qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402rx.h
/******************  Bit definition for CRM_AHBEN1 register  ******************/
#define CRM_AHBEN1_GPIOAEN_Pos              (0U)
#define CRM_AHBEN1_GPIOAEN_Msk              (0x1U << CRM_AHBEN1_GPIOAEN_Pos)        /*!< 0x00000001 */
#define CRM_AHBEN1_GPIOAEN                  CRM_AHBEN1_GPIOAEN_Msk                  /*!< IO port A clock enable */
#define CRM_AHBEN1_GPIOBEN_Pos              (1U)
#define CRM_AHBEN1_GPIOBEN_Msk              (0x1U << CRM_AHBEN1_GPIOBEN_Pos)        /*!< 0x00000002 */
#define CRM_AHBEN1_GPIOBEN                  CRM_AHBEN1_GPIOBEN_Msk                  /*!< IO port B clock enable */
#define CRM_AHBEN1_GPIOCEN_Pos              (2U)
#define CRM_AHBEN1_GPIOCEN_Msk              (0x1U << CRM_AHBEN1_GPIOCEN_Pos)        /*!< 0x00000004 */
#define CRM_AHBEN1_GPIOCEN                  CRM_AHBEN1_GPIOCEN_Msk                  /*!< IO port C clock enable */
#define CRM_AHBEN1_GPIODEN_Pos              (3U)
#define CRM_AHBEN1_GPIODEN_Msk              (0x1U << CRM_AHBEN1_GPIODEN_Pos)        /*!< 0x00000008 */
#define CRM_AHBEN1_GPIODEN                  CRM_AHBEN1_GPIODEN_Msk                  /*!< IO port D clock enable */
#define CRM_AHBEN1_GPIOFEN_Pos              (5U)
#define CRM_AHBEN1_GPIOFEN_Msk              (0x1U << CRM_AHBEN1_GPIOFEN_Pos)        /*!< 0x00000020 */
#define CRM_AHBEN1_GPIOFEN                  CRM_AHBEN1_GPIOFEN_Msk                  /*!< IO port F clock enable */
#define CRM_AHBEN1_CRCEN_Pos                (12U)
#define CRM_AHBEN1_CRCEN_Msk                (0x1U << CRM_AHBEN1_CRCEN_Pos)          /*!< 0x00001000 */
#define CRM_AHBEN1_CRCEN                    CRM_AHBEN1_CRCEN_Msk                    /*!< CRC clock enable */
#define CRM_AHBEN1_DMA1EN_Pos               (22U)
#define CRM_AHBEN1_DMA1EN_Msk               (0x1U << CRM_AHBEN1_DMA1EN_Pos)         /*!< 0x00400000 */
#define CRM_AHBEN1_DMA1EN                   CRM_AHBEN1_DMA1EN_Msk                   /*!< DMA1 clock enable */
#define CRM_AHBEN1_DMA2EN_Pos               (24U)
#define CRM_AHBEN1_DMA2EN_Msk               (0x1U << CRM_AHBEN1_DMA2EN_Pos)         /*!< 0x01000000 */
#define CRM_AHBEN1_DMA2EN                   CRM_AHBEN1_DMA2EN_Msk                   /*!< DMA2 clock enable */

/******************  Bit definition for CRM_AHBEN2 register  ******************/
#define CRM_AHBEN2_OTGFSEN_Pos              (7U)
#define CRM_AHBEN2_OTGFSEN_Msk              (0x1U << CRM_AHBEN2_OTGFSEN_Pos)        /*!< 0x00000080 */
#define CRM_AHBEN2_OTGFSEN                  CRM_AHBEN2_OTGFSEN_Msk                  /*!< OTGFS clock enable */

/******************  Bit definition for CRM_AHBEN3 register  ******************/
#define CRM_AHBEN3_QSPI1EN_Pos              (1U)
#define CRM_AHBEN3_QSPI1EN_Msk              (0x1U << CRM_AHBEN3_QSPI1EN_Pos)        /*!< 0x00000002 */
#define CRM_AHBEN3_QSPI1EN                  CRM_AHBEN3_QSPI1EN_Msk                  /*!< QSPI1 clock enable */

/******************  Bit definition for CRM_APB1EN register  ******************/
#define CRM_APB1EN_TMR2EN_Pos               (0U)
#define CRM_APB1EN_TMR2EN_Msk               (0x1U << CRM_APB1EN_TMR2EN_Pos)         /*!< 0x00000001 */
#define CRM_APB1EN_TMR2EN                   CRM_APB1EN_TMR2EN_Msk                   /*!< TMR2 clock enable */
#define CRM_APB1EN_TMR3EN_Pos               (1U)
#define CRM_APB1EN_TMR3EN_Msk               (0x1U << CRM_APB1EN_TMR3EN_Pos)         /*!< 0x00000002 */
#define CRM_APB1EN_TMR3EN                   CRM_APB1EN_TMR3EN_Msk                   /*!< TMR3 clock enable */
#define CRM_APB1EN_TMR4EN_Pos               (2U)
#define CRM_APB1EN_TMR4EN_Msk               (0x1U << CRM_APB1EN_TMR4EN_Pos)         /*!< 0x00000004 */
#define CRM_APB1EN_TMR4EN                   CRM_APB1EN_TMR4EN_Msk                   /*!< TMR4 clock enable */
#define CRM_APB1EN_TMR6EN_Pos               (4U)
#define CRM_APB1EN_TMR6EN_Msk               (0x1U << CRM_APB1EN_TMR6EN_Pos)         /*!< 0x00000010 */
#define CRM_APB1EN_TMR6EN                   CRM_APB1EN_TMR6EN_Msk                   /*!< TMR6 clock enable */
#define CRM_APB1EN_TMR7EN_Pos               (5U)
#define CRM_APB1EN_TMR7EN_Msk               (0x1U << CRM_APB1EN_TMR7EN_Pos)         /*!< 0x00000020 */
#define CRM_APB1EN_TMR7EN                   CRM_APB1EN_TMR7EN_Msk                   /*!< TMR7 clock enable */
#define CRM_APB1EN_TMR13EN_Pos              (7U)
#define CRM_APB1EN_TMR13EN_Msk              (0x1U << CRM_APB1EN_TMR13EN_Pos)        /*!< 0x00000080 */
#define CRM_APB1EN_TMR13EN                  CRM_APB1EN_TMR13EN_Msk                  /*!< TMR13 clock enable */
#define CRM_APB1EN_TMR14EN_Pos              (8U)
#define CRM_APB1EN_TMR14EN_Msk              (0x1U << CRM_APB1EN_TMR14EN_Pos)        /*!< 0x00000100 */
#define CRM_APB1EN_TMR14EN                  CRM_APB1EN_TMR14EN_Msk                  /*!< TMR14 clock enable */
#define CRM_APB1EN_WWDTEN_Pos               (11U)
#define CRM_APB1EN_WWDTEN_Msk               (0x1U << CRM_APB1EN_WWDTEN_Pos)         /*!< 0x00000800 */
#define CRM_APB1EN_WWDTEN                   CRM_APB1EN_WWDTEN_Msk                   /*!< WWDT clock enable */
#define CRM_APB1EN_SPI2EN_Pos               (14U)
#define CRM_APB1EN_SPI2EN_Msk               (0x1U << CRM_APB1EN_SPI2EN_Pos)         /*!< 0x00004000 */
#define CRM_APB1EN_SPI2EN                   CRM_APB1EN_SPI2EN_Msk                   /*!< SPI2 clock enable */
#define CRM_APB1EN_SPI3EN_Pos               (15U)
#define CRM_APB1EN_SPI3EN_Msk               (0x1U << CRM_APB1EN_SPI3EN_Pos)         /*!< 0x00008000 */
#define CRM_APB1EN_SPI3EN                   CRM_APB1EN_SPI3EN_Msk                   /*!< SPI3 clock enable */
#define CRM_APB1EN_USART2EN_Pos             (17U)
#define CRM_APB1EN_USART2EN_Msk             (0x1U << CRM_APB1EN_USART2EN_Pos)       /*!< 0x00020000 */
#define CRM_APB1EN_USART2EN                 CRM_APB1EN_USART2EN_Msk                 /*!< USART2 clock enable */
#define CRM_APB1EN_USART3EN_Pos             (18U)
#define CRM_APB1EN_USART3EN_Msk             (0x1U << CRM_APB1EN_USART3EN_Pos)       /*!< 0x00040000 */
#define CRM_APB1EN_USART3EN                 CRM_APB1EN_USART3EN_Msk                 /*!< USART3 clock enable */
#define CRM_APB1EN_USART4EN_Pos             (19U)
#define CRM_APB1EN_USART4EN_Msk             (0x1U << CRM_APB1EN_USART4EN_Pos)       /*!< 0x00080000 */
#define CRM_APB1EN_USART4EN                 CRM_APB1EN_USART4EN_Msk                 /*!< USART4 clock enable */
#define CRM_APB1EN_USART5EN_Pos             (20U)
#define CRM_APB1EN_USART5EN_Msk             (0x1U << CRM_APB1EN_USART5EN_Pos)       /*!< 0x00100000 */
#define CRM_APB1EN_USART5EN                 CRM_APB1EN_USART5EN_Msk                 /*!< USART5 clock enable */
#define CRM_APB1EN_I2C1EN_Pos               (21U)
#define CRM_APB1EN_I2C1EN_Msk               (0x1U << CRM_APB1EN_I2C1EN_Pos)         /*!< 0x00200000 */
#define CRM_APB1EN_I2C1EN                   CRM_APB1EN_I2C1EN_Msk                   /*!< I2C1 clock enable */
#define CRM_APB1EN_I2C2EN_Pos               (22U)
#define CRM_APB1EN_I2C2EN_Msk               (0x1U << CRM_APB1EN_I2C2EN_Pos)         /*!< 0x00400000 */
#define CRM_APB1EN_I2C2EN                   CRM_APB1EN_I2C2EN_Msk                   /*!< I2C2 clock enable */
#define CRM_APB1EN_I2C3EN_Pos               (23U)
#define CRM_APB1EN_I2C3EN_Msk               (0x1U << CRM_APB1EN_I2C3EN_Pos)         /*!< 0x00800000 */
#define CRM_APB1EN_I2C3EN                   CRM_APB1EN_I2C3EN_Msk                   /*!< I2C3 clock enable */
#define CRM_APB1EN_CAN1EN_Pos               (25U)
#define CRM_APB1EN_CAN1EN_Msk               (0x1U << CRM_APB1EN_CAN1EN_Pos)         /*!< 0x02000000 */
#define CRM_APB1EN_CAN1EN                   CRM_APB1EN_CAN1EN_Msk                   /*!< CAN1 clock enable */
#define CRM_APB1EN_PWCEN_Pos                (28U)
#define CRM_APB1EN_PWCEN_Msk                (0x1U << CRM_APB1EN_PWCEN_Pos)          /*!< 0x10000000 */
#define CRM_APB1EN_PWCEN                    CRM_APB1EN_PWCEN_Msk                    /*!< Power control clock enable */
#define CRM_APB1EN_UART7EN_Pos              (30U)
#define CRM_APB1EN_UART7EN_Msk              (0x1U << CRM_APB1EN_UART7EN_Pos)        /*!< 0x40000000 */
#define CRM_APB1EN_UART7EN                  CRM_APB1EN_UART7EN_Msk                  /*!< UART7 clock enable */
#define CRM_APB1EN_UART8EN_Pos              (31U)
#define CRM_APB1EN_UART8EN_Msk              (0x1U << CRM_APB1EN_UART8EN_Pos)        /*!< 0x80000000 */
#define CRM_APB1EN_UART8EN                  CRM_APB1EN_UART8EN_Msk                  /*!< UART8 clock enable */

/******************  Bit definition for CRM_APB2EN register  ******************/
#define CRM_APB2EN_TMR1EN_Pos               (0U)
#define CRM_APB2EN_TMR1EN_Msk               (0x1U << CRM_APB2EN_TMR1EN_Pos)         /*!< 0x00000001 */
#define CRM_APB2EN_TMR1EN                   CRM_APB2EN_TMR1EN_Msk                   /*!< TMR1 clock enable */
#define CRM_APB2EN_USART1EN_Pos             (4U)
#define CRM_APB2EN_USART1EN_Msk             (0x1U << CRM_APB2EN_USART1EN_Pos)       /*!< 0x00000010 */
#define CRM_APB2EN_USART1EN                 CRM_APB2EN_USART1EN_Msk                 /*!< USART1 clock enable */
#define CRM_APB2EN_USART6EN_Pos             (5U)
#define CRM_APB2EN_USART6EN_Msk             (0x1U << CRM_APB2EN_USART6EN_Pos)       /*!< 0x00000020 */
#define CRM_APB2EN_USART6EN                 CRM_APB2EN_USART6EN_Msk                 /*!< USART6 clock enable */
#define CRM_APB2EN_ADC1EN_Pos               (8U)
#define CRM_APB2EN_ADC1EN_Msk               (0x1U << CRM_APB2EN_ADC1EN_Pos)         /*!< 0x00000100 */
#define CRM_APB2EN_ADC1EN                   CRM_APB2EN_ADC1EN_Msk                   /*!< ADC1 clock enable */
#define CRM_APB2EN_SPI1EN_Pos               (12U)
#define CRM_APB2EN_SPI1EN_Msk               (0x1U << CRM_APB2EN_SPI1EN_Pos)         /*!< 0x00001000 */
#define CRM_APB2EN_SPI1EN                   CRM_APB2EN_SPI1EN_Msk                   /*!< SPI1 clock enable */
#define CRM_APB2EN_SCFGEN_Pos               (14U)
#define CRM_APB2EN_SCFGEN_Msk               (0x1U << CRM_APB2EN_SCFGEN_Pos)         /*!< 0x00004000 */
#define CRM_APB2EN_SCFGEN                   CRM_APB2EN_SCFGEN_Msk                   /*!< SCFG clock enable */
#define CRM_APB2EN_TMR9EN_Pos               (16U)
#define CRM_APB2EN_TMR9EN_Msk               (0x1U << CRM_APB2EN_TMR9EN_Pos)         /*!< 0x00010000 */
#define CRM_APB2EN_TMR9EN                   CRM_APB2EN_TMR9EN_Msk                   /*!< TMR9 clock enable */
#define CRM_APB2EN_TMR10EN_Pos              (17U)
#define CRM_APB2EN_TMR10EN_Msk              (0x1U << CRM_APB2EN_TMR10EN_Pos)        /*!< 0x00020000 */
#define CRM_APB2EN_TMR10EN                  CRM_APB2EN_TMR10EN_Msk                  /*!< TMR10 clock enable */
#define CRM_APB2EN_TMR11EN_Pos              (18U)
#define CRM_APB2EN_TMR11EN_Msk              (0x1U << CRM_APB2EN_TMR11EN_Pos)        /*!< 0x00040000 */
#define CRM_APB2EN_TMR11EN                  CRM_APB2EN_TMR11EN_Msk                  /*!< TMR11 clock enable */
#define CRM_APB2EN_I2SF5EN_Pos              (20U)
#define CRM_APB2EN_I2SF5EN_Msk              (0x1U << CRM_APB2EN_I2SF5EN_Pos)        /*!< 0x00100000 */
#define CRM_APB2EN_I2SF5EN                  CRM_APB2EN_I2SF5EN_Msk                  /*!< I2SF5 clock enable */
#define CRM_APB2EN_ACCEN_Pos                (29U)
#define CRM_APB2EN_ACCEN_Msk                (0x1U << CRM_APB2EN_ACCEN_Pos)          /*!< 0x20000000 */
#define CRM_APB2EN_ACCEN                    CRM_APB2EN_ACCEN_Msk                    /*!< ACC clock enable */

/*****************  Bit definition for CRM_AHBLPEN1 register  *****************/
#define CRM_AHBLPEN1_GPIOALPEN_Pos          (0U)
#define CRM_AHBLPEN1_GPIOALPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOALPEN_Pos)    /*!< 0x00000001 */
#define CRM_AHBLPEN1_GPIOALPEN              CRM_AHBLPEN1_GPIOALPEN_Msk              /*!< IO port A clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOBLPEN_Pos          (1U)
#define CRM_AHBLPEN1_GPIOBLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOBLPEN_Pos)    /*!< 0x00000002 */
#define CRM_AHBLPEN1_GPIOBLPEN              CRM_AHBLPEN1_GPIOBLPEN_Msk              /*!< IO port B clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOCLPEN_Pos          (2U)
#define CRM_AHBLPEN1_GPIOCLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOCLPEN_Pos)    /*!< 0x00000004 */
#define CRM_AHBLPEN1_GPIOCLPEN              CRM_AHBLPEN1_GPIOCLPEN_Msk              /*!< IO port C clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIODLPEN_Pos          (3U)
#define CRM_AHBLPEN1_GPIODLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIODLPEN_Pos)    /*!< 0x00000008 */
#define CRM_AHBLPEN1_GPIODLPEN              CRM_AHBLPEN1_GPIODLPEN_Msk              /*!< IO port D clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOFLPEN_Pos          (5U)
#define CRM_AHBLPEN1_GPIOFLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOFLPEN_Pos)    /*!< 0x00000020 */
#define CRM_AHBLPEN1_GPIOFLPEN              CRM_AHBLPEN1_GPIOFLPEN_Msk              /*!< IO port F clock enable in sleep mode */
#define CRM_AHBLPEN1_CRCLPEN_Pos            (12U)
#define CRM_AHBLPEN1_CRCLPEN_Msk            (0x1U << CRM_AHBLPEN1_CRCLPEN_Pos)      /*!< 0x00001000 */
#define CRM_AHBLPEN1_CRCLPEN                CRM_AHBLPEN1_CRCLPEN_Msk                /*!< CRC clock enable in sleep mode */
#define CRM_AHBLPEN1_FLASHLPEN_Pos          (15U)
#define CRM_AHBLPEN1_FLASHLPEN_Msk          (0x1U << CRM_AHBLPEN1_FLASHLPEN_Pos)    /*!< 0x00008000 */
#define CRM_AHBLPEN1_FLASHLPEN              CRM_AHBLPEN1_FLASHLPEN_Msk              /*!< FLASH clock enable in sleep mode */
#define CRM_AHBLPEN1_SRAMLPEN_Pos           (16U)
#define CRM_AHBLPEN1_SRAMLPEN_Msk           (0x1U << CRM_AHBLPEN1_SRAMLPEN_Pos)     /*!< 0x00010000 */
#define CRM_AHBLPEN1_SRAMLPEN               CRM_AHBLPEN1_SRAMLPEN_Msk               /*!< SRAM clock enable in sleep mode */
#define CRM_AHBLPEN1_DMA1LPEN_Pos           (22U)
#define CRM_AHBLPEN1_DMA1LPEN_Msk           (0x1U << CRM_AHBLPEN1_DMA1LPEN_Pos)     /*!< 0x00400000 */
#define CRM_AHBLPEN1_DMA1LPEN               CRM_AHBLPEN1_DMA1LPEN_Msk               /*!< DMA1 clock enable in sleep mode */
#define CRM_AHBLPEN1_DMA2LPEN_Pos           (24U)
#define CRM_AHBLPEN1_DMA2LPEN_Msk           (0x1U << CRM_AHBLPEN1_DMA2LPEN_Pos)     /*!< 0x01000000 */
#define CRM_AHBLPEN1_DMA2LPEN               CRM_AHBLPEN1_DMA2LPEN_Msk               /*!< DMA2 clock enable in sleep mode */

/*****************  Bit definition for CRM_AHBLPEN2 register  *****************/
#define CRM_AHBLPEN2_OTGFSLPEN_Pos          (7U)
#define CRM_AHBLPEN2_OTGFSLPEN_Msk          (0x1U << CRM_AHBLPEN2_OTGFSLPEN_Pos)    /*!< 0x00000080 */
#define CRM_AHBLPEN2_OTGFSLPEN              CRM_AHBLPEN2_OTGFSLPEN_Msk              /*!< OTGFS clock enable in sleep mode */

/*****************  Bit definition for CRM_AHBLPEN3 register  *****************/
#define CRM_AHBLPEN3_QSPI1LPEN_Pos          (1U)
#define CRM_AHBLPEN3_QSPI1LPEN_Msk          (0x1U << CRM_AHBLPEN3_QSPI1LPEN_Pos)    /*!< 0x00000002 */
#define CRM_AHBLPEN3_QSPI1LPEN              CRM_AHBLPEN3_QSPI1LPEN_Msk              /*!< QSPI1 clock enable in sleep mode */

/*****************  Bit definition for CRM_APB1LPEN register  *****************/
#define CRM_APB1LPEN_TMR2LPEN_Pos           (0U)
#define CRM_APB1LPEN_TMR2LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR2LPEN_Pos)     /*!< 0x00000001 */
#define CRM_APB1LPEN_TMR2LPEN               CRM_APB1LPEN_TMR2LPEN_Msk               /*!< TMR2 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR3LPEN_Pos           (1U)
#define CRM_APB1LPEN_TMR3LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR3LPEN_Pos)     /*!< 0x00000002 */
#define CRM_APB1LPEN_TMR3LPEN               CRM_APB1LPEN_TMR3LPEN_Msk               /*!< TMR3 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR4LPEN_Pos           (2U)
#define CRM_APB1LPEN_TMR4LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR4LPEN_Pos)     /*!< 0x00000004 */
#define CRM_APB1LPEN_TMR4LPEN               CRM_APB1LPEN_TMR4LPEN_Msk               /*!< TMR4 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR6LPEN_Pos           (4U)
#define CRM_APB1LPEN_TMR6LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR6LPEN_Pos)     /*!< 0x00000010 */
#define CRM_APB1LPEN_TMR6LPEN               CRM_APB1LPEN_TMR6LPEN_Msk               /*!< TMR6 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR7LPEN_Pos           (5U)
#define CRM_APB1LPEN_TMR7LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR7LPEN_Pos)     /*!< 0x00000020 */
#define CRM_APB1LPEN_TMR7LPEN               CRM_APB1LPEN_TMR7LPEN_Msk               /*!< TMR7 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR13LPEN_Pos          (7U)
#define CRM_APB1LPEN_TMR13LPEN_Msk          (0x1U << CRM_APB1LPEN_TMR13LPEN_Pos)    /*!< 0x00000080 */
#define CRM_APB1LPEN_TMR13LPEN              CRM_APB1LPEN_TMR13LPEN_Msk              /*!< TMR13 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR14LPEN_Pos          (8U)
#define CRM_APB1LPEN_TMR14LPEN_Msk          (0x1U << CRM_APB1LPEN_TMR14LPEN_Pos)    /*!< 0x00000100 */
#define CRM_APB1LPEN_TMR14LPEN              CRM_APB1LPEN_TMR14LPEN_Msk              /*!< TMR14 clock enable in sleep mode */
#define CRM_APB1LPEN_WWDTLPEN_Pos           (11U)
#define CRM_APB1LPEN_WWDTLPEN_Msk           (0x1U << CRM_APB1LPEN_WWDTLPEN_Pos)     /*!< 0x00000800 */
#define CRM_APB1LPEN_WWDTLPEN               CRM_APB1LPEN_WWDTLPEN_Msk               /*!< WWDT clock enable in sleep mode */
#define CRM_APB1LPEN_SPI2LPEN_Pos           (14U)
#define CRM_APB1LPEN_SPI2LPEN_Msk           (0x1U << CRM_APB1LPEN_SPI2LPEN_Pos)     /*!< 0x00004000 */
#define CRM_APB1LPEN_SPI2LPEN               CRM_APB1LPEN_SPI2LPEN_Msk               /*!< SPI2 clock enable in sleep mode */
#define CRM_APB1LPEN_SPI3LPEN_Pos           (15U)
#define CRM_APB1LPEN_SPI3LPEN_Msk           (0x1U << CRM_APB1LPEN_SPI3LPEN_Pos)     /*!< 0x00008000 */
#define CRM_APB1LPEN_SPI3LPEN               CRM_APB1LPEN_SPI3LPEN_Msk               /*!< SPI3 clock enable in sleep mode */
#define CRM_APB1LPEN_USART2LPEN_Pos         (17U)
#define CRM_APB1LPEN_USART2LPEN_Msk         (0x1U << CRM_APB1LPEN_USART2LPEN_Pos)   /*!< 0x00020000 */
#define CRM_APB1LPEN_USART2LPEN             CRM_APB1LPEN_USART2LPEN_Msk             /*!< USART2 clock enable in sleep mode */
#define CRM_APB1LPEN_USART3LPEN_Pos         (18U)
#define CRM_APB1LPEN_USART3LPEN_Msk         (0x1U << CRM_APB1LPEN_USART3LPEN_Pos)   /*!< 0x00040000 */
#define CRM_APB1LPEN_USART3LPEN             CRM_APB1LPEN_USART3LPEN_Msk             /*!< USART3 clock enable in sleep mode */
#define CRM_APB1LPEN_USART4LPEN_Pos         (19U)
#define CRM_APB1LPEN_USART4LPEN_Msk         (0x1U << CRM_APB1LPEN_USART4LPEN_Pos)   /*!< 0x00080000 */
#define CRM_APB1LPEN_USART4LPEN             CRM_APB1LPEN_USART4LPEN_Msk             /*!< USART4 clock enable in sleep mode */
#define CRM_APB1LPEN_USART5LPEN_Pos         (20U)
#define CRM_APB1LPEN_USART5LPEN_Msk         (0x1U << CRM_APB1LPEN_USART5LPEN_Pos)   /*!< 0x00100000 */
#define CRM_APB1LPEN_USART5LPEN             CRM_APB1LPEN_USART5LPEN_Msk             /*!< USART5 clock enable in sleep mode */
#define CRM_APB1LPEN_I2C1LPEN_Pos           (21U)
#define CRM_APB1LPEN_I2C1LPEN_Msk           (0x1U << CRM_APB1LPEN_I2C1LPEN_Pos)     /*!< 0x00200000 */
#define CRM_APB1LPEN_I2C1LPEN               CRM_APB1LPEN_I2C1LPEN_Msk               /*!< I2C1 clock enable in sleep mode */
#define CRM_APB1LPEN_I2C2LPEN_Pos           (22U)
#define CRM_APB1LPEN_I2C2LPEN_Msk           (0x1U << CRM_APB1LPEN_I2C2LPEN_Pos)     /*!< 0x00400000 */
#define CRM_APB1LPEN_I2C2LPEN               CRM_APB1LPEN_I2C2LPEN_Msk               /*!< I2C2 clock enable in sleep mode */
#define CRM_APB1LPEN_I2C3LPEN_Pos           (23U)
#define CRM_APB1LPEN_I2C3LPEN_Msk           (0x1U << CRM_APB1LPEN_I2C3LPEN_Pos)     /*!< 0x00800000 */
#define CRM_APB1LPEN_I2C3LPEN               CRM_APB1LPEN_I2C3LPEN_Msk               /*!< I2C3 clock enable in sleep mode */
#define CRM_APB1LPEN_CAN1LPEN_Pos           (25U)
#define CRM_APB1LPEN_CAN1LPEN_Msk           (0x1U << CRM_APB1LPEN_CAN1LPEN_Pos)     /*!< 0x02000000 */
#define CRM_APB1LPEN_CAN1LPEN               CRM_APB1LPEN_CAN1LPEN_Msk               /*!< CAN1 clock enable in sleep mode */
#define CRM_APB1LPEN_PWCLPEN_Pos            (28U)
#define CRM_APB1LPEN_PWCLPEN_Msk            (0x1U << CRM_APB1LPEN_PWCLPEN_Pos)      /*!< 0x10000000 */
#define CRM_APB1LPEN_PWCLPEN                CRM_APB1LPEN_PWCLPEN_Msk                /*!< Power control clock enable in sleep mode */
#define CRM_APB1LPEN_UART7LPEN_Pos          (30U)
#define CRM_APB1LPEN_UART7LPEN_Msk          (0x1U << CRM_APB1LPEN_UART7LPEN_Pos)    /*!< 0x40000000 */
#define CRM_APB1LPEN_UART7LPEN              CRM_APB1LPEN_UART7LPEN_Msk              /*!< UART7 clock enable in sleep mode */
#define CRM_APB1LPEN_UART8LPEN_Pos          (31U)
#define CRM_APB1LPEN_UART8LPEN_Msk          (0x1U << CRM_APB1LPEN_UART8LPEN_Pos)    /*!< 0x80000000 */
#define CRM_APB1LPEN_UART8LPEN              CRM_APB1LPEN_UART8LPEN_Msk              /*!< UART8 clock enable in sleep mode */

