qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402rx.h
#define SCFG_CFG1_IR_POL_Pos                (5U)
#define SCFG_CFG1_IR_POL_Msk                (0x1U << SCFG_CFG1_IR_POL_Pos)          /*!< 0x00000020 */
#define SCFG_CFG1_IR_POL                    SCFG_CFG1_IR_POL_Msk                    /*!< Infrared output polarity selection */

/*!< IR_SRC_SEL configuration */
#define SCFG_CFG1_IR_SRC_SEL_Pos            (6U)
#define SCFG_CFG1_IR_SRC_SEL_Msk            (0x3U << SCFG_CFG1_IR_SRC_SEL_Pos)      /*!< 0x000000C0 */
#define SCFG_CFG1_IR_SRC_SEL                SCFG_CFG1_IR_SRC_SEL_Msk                /*!< IR_SRC_SEL[1:0] bits (IR modulation envelope signal source selection) */
#define SCFG_CFG1_IR_SRC_SEL_0              (0x1U << SCFG_CFG1_IR_SRC_SEL_Pos)      /*!< 0x00000040 */
#define SCFG_CFG1_IR_SRC_SEL_1              (0x2U << SCFG_CFG1_IR_SRC_SEL_Pos)      /*!< 0x00000080 */

#define SCFG_CFG1_IR_SRC_SEL_TMR10          0x00000000U                             /*!< TMR10 */
#define SCFG_CFG1_IR_SRC_SEL_USART1         0x00000040U                             /*!< USART1 */
#define SCFG_CFG1_IR_SRC_SEL_USART2         0x00000080U                             /*!< USART2 */

/******************  Bit definition for SCFG_CFG2 register  *******************/
#define SCFG_CFG2_LOCKUP_LK_Pos             (0U)
#define SCFG_CFG2_LOCKUP_LK_Msk             (0x1U << SCFG_CFG2_LOCKUP_LK_Pos)       /*!< 0x00000001 */
#define SCFG_CFG2_LOCKUP_LK                 SCFG_CFG2_LOCKUP_LK_Msk                 /*!< Cortex-M4F lockup bit enable */
#define SCFG_CFG2_SRAM_OPERR_LK_Pos         (1U)
#define SCFG_CFG2_SRAM_OPERR_LK_Msk         (0x1U << SCFG_CFG2_SRAM_OPERR_LK_Pos)   /*!< 0x00000002 */
#define SCFG_CFG2_SRAM_OPERR_LK             SCFG_CFG2_SRAM_OPERR_LK_Msk             /*!< SRAM odd parity error lock enable */
#define SCFG_CFG2_PVM_LK_Pos                (2U)
#define SCFG_CFG2_PVM_LK_Msk                (0x1U << SCFG_CFG2_PVM_LK_Pos)          /*!< 0x00000004 */
#define SCFG_CFG2_PVM_LK                    SCFG_CFG2_PVM_LK_Msk                    /*!< PVM lock enable */
#define SCFG_CFG2_SRAM_OPERR_STS_Pos        (8U)
#define SCFG_CFG2_SRAM_OPERR_STS_Msk        (0x1U << SCFG_CFG2_SRAM_OPERR_STS_Pos)  /*!< 0x00000100 */
#define SCFG_CFG2_SRAM_OPERR_STS            SCFG_CFG2_SRAM_OPERR_STS_Msk            /*!< SRAM odd parity error status */

/*!< I2S_FD configuration */
#define SCFG_CFG2_I2S_FD_Pos                (30U)
#define SCFG_CFG2_I2S_FD_Msk                (0x3U << SCFG_CFG2_I2S_FD_Pos)          /*!< 0xC0000000 */
#define SCFG_CFG2_I2S_FD                    SCFG_CFG2_I2S_FD_Msk                    /*!< I2S_FD[1:0] bits (I2S full duplex configuration bit) */
#define SCFG_CFG2_I2S_FD_0                  (0x1U << SCFG_CFG2_I2S_FD_Pos)          /*!< 0x40000000 */
#define SCFG_CFG2_I2S_FD_1                  (0x2U << SCFG_CFG2_I2S_FD_Pos)          /*!< 0x80000000 */

#define SCFG_CFG2_I2S_FD_SPI_I2S            0x00000000U                             /*!< SPI / I2S1 ~ 3 operates separately */
#define SCFG_CFG2_I2S_FD_I2S1_3_FD          0x40000000U                             /*!< I2S1 and I2S3 are configured as full-duplex mode */
#define SCFG_CFG2_I2S_FD_I2S2_3_FD          0x80000000U                             /*!< I2S2 and I2S3 are configured as full-duplex mode */
#define SCFG_CFG2_I2S_FD_I2S1_2_FD          0xC0000000U                             /*!< I2S1 and I2S2 are configured as full-duplex mode */

/*****************  Bit definition for SCFG_EXINTC1 register  *****************/
/*!< EXINT0 configuration */
#define SCFG_EXINTC1_EXINT0_Pos             (0U)
#define SCFG_EXINTC1_EXINT0_Msk             (0xFU << SCFG_EXINTC1_EXINT0_Pos)       /*!< 0x0000000F */
#define SCFG_EXINTC1_EXINT0                 SCFG_EXINTC1_EXINT0_Msk                 /*!< EXINT0[3:0] bits (EXINT0 input source configuration) */

#define SCFG_EXINTC1_EXINT0_GPA             0x00000000U                             /*!< GPIOA pin 0 */
#define SCFG_EXINTC1_EXINT0_GPB_Pos         (0U)
#define SCFG_EXINTC1_EXINT0_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT0_GPB_Pos)   /*!< 0x00000001 */
#define SCFG_EXINTC1_EXINT0_GPB             SCFG_EXINTC1_EXINT0_GPB_Msk             /*!< GPIOB pin 0 */
#define SCFG_EXINTC1_EXINT0_GPC_Pos         (1U)
#define SCFG_EXINTC1_EXINT0_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT0_GPC_Pos)   /*!< 0x00000002 */
#define SCFG_EXINTC1_EXINT0_GPC             SCFG_EXINTC1_EXINT0_GPC_Msk             /*!< GPIOC pin 0 */
#define SCFG_EXINTC1_EXINT0_GPD_Pos         (0U)
#define SCFG_EXINTC1_EXINT0_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT0_GPD_Pos)   /*!< 0x00000003 */
#define SCFG_EXINTC1_EXINT0_GPD             SCFG_EXINTC1_EXINT0_GPD_Msk             /*!< GPIOD pin 0 */
#define SCFG_EXINTC1_EXINT0_GPF_Pos         (2U)
#define SCFG_EXINTC1_EXINT0_GPF_Msk         (0x1U << SCFG_EXINTC1_EXINT0_GPF_Pos)   /*!< 0x00000004 */
#define SCFG_EXINTC1_EXINT0_GPF             SCFG_EXINTC1_EXINT0_GPF_Msk             /*!< GPIOF pin 0 */

/*!< EXINT1 configuration */
#define SCFG_EXINTC1_EXINT1_Pos             (4U)
#define SCFG_EXINTC1_EXINT1_Msk             (0xFU << SCFG_EXINTC1_EXINT1_Pos)       /*!< 0x000000F0 */
#define SCFG_EXINTC1_EXINT1                 SCFG_EXINTC1_EXINT1_Msk                 /*!< EXINT1[3:0] bits (EXINT1 input source configuration) */

#define SCFG_EXINTC1_EXINT1_GPA             0x00000000U                             /*!< GPIOA pin 1 */
#define SCFG_EXINTC1_EXINT1_GPB_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT1_GPB_Pos)   /*!< 0x00000010 */
#define SCFG_EXINTC1_EXINT1_GPB             SCFG_EXINTC1_EXINT1_GPB_Msk             /*!< GPIOB pin 1 */
#define SCFG_EXINTC1_EXINT1_GPC_Pos         (5U)
#define SCFG_EXINTC1_EXINT1_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT1_GPC_Pos)   /*!< 0x00000020 */
#define SCFG_EXINTC1_EXINT1_GPC             SCFG_EXINTC1_EXINT1_GPC_Msk             /*!< GPIOC pin 1 */
#define SCFG_EXINTC1_EXINT1_GPD_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT1_GPD_Pos)   /*!< 0x00000030 */
#define SCFG_EXINTC1_EXINT1_GPD             SCFG_EXINTC1_EXINT1_GPD_Msk             /*!< GPIOD pin 1 */
#define SCFG_EXINTC1_EXINT1_GPF_Pos         (6U)
#define SCFG_EXINTC1_EXINT1_GPF_Msk         (0x1U << SCFG_EXINTC1_EXINT1_GPF_Pos)   /*!< 0x00000040 */
#define SCFG_EXINTC1_EXINT1_GPF             SCFG_EXINTC1_EXINT1_GPF_Msk             /*!< GPIOF pin 1 */

