qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402/at32f402rx.h
/*******************  Bit definition for ACC_STS register  ********************/
#define ACC_STS_CALRDY_Pos                  (0U)
#define ACC_STS_CALRDY_Msk                  (0x1U << ACC_STS_CALRDY_Pos)            /*!< 0x00000001 */
#define ACC_STS_CALRDY                      ACC_STS_CALRDY_Msk                      /*!< Internal high-speed clock calibration ready */
#define ACC_STS_RSLOST_Pos                  (1U)
#define ACC_STS_RSLOST_Msk                  (0x1U << ACC_STS_RSLOST_Pos)            /*!< 0x00000002 */
#define ACC_STS_RSLOST                      ACC_STS_RSLOST_Msk                      /*!< Reference signal lost */

/******************  Bit definition for ACC_CTRL1 register  *******************/
#define ACC_CTRL1_CALON_Pos                 (0U)
#define ACC_CTRL1_CALON_Msk                 (0x1U << ACC_CTRL1_CALON_Pos)           /*!< 0x00000001 */
#define ACC_CTRL1_CALON                     ACC_CTRL1_CALON_Msk                     /*!< Calibration on */
#define ACC_CTRL1_ENTRIM_Pos                (1U)
#define ACC_CTRL1_ENTRIM_Msk                (0x1U << ACC_CTRL1_ENTRIM_Pos)          /*!< 0x00000002 */
#define ACC_CTRL1_ENTRIM                    ACC_CTRL1_ENTRIM_Msk                    /*!< Enable trim */
#define ACC_CTRL1_EIEN_Pos                  (4U)
#define ACC_CTRL1_EIEN_Msk                  (0x1U << ACC_CTRL1_EIEN_Pos)            /*!< 0x00000010 */
#define ACC_CTRL1_EIEN                      ACC_CTRL1_EIEN_Msk                      /*!< RSLOST error interrupt enable */
#define ACC_CTRL1_CALRDYIEN_Pos             (5U)
#define ACC_CTRL1_CALRDYIEN_Msk             (0x1U << ACC_CTRL1_CALRDYIEN_Pos)       /*!< 0x00000020 */
#define ACC_CTRL1_CALRDYIEN                 ACC_CTRL1_CALRDYIEN_Msk                 /*!< CALRDY interrupt enable */
#define ACC_CTRL1_STEP_Pos                  (8U)
#define ACC_CTRL1_STEP_Msk                  (0xFU << ACC_CTRL1_STEP_Pos)            /*!< 0x00000F00 */
#define ACC_CTRL1_STEP                      ACC_CTRL1_STEP_Msk                      /*!< Calibrated step */

/******************  Bit definition for ACC_CTRL2 register  *******************/
#define ACC_CTRL2_HICKCAL_Pos               (0U)
#define ACC_CTRL2_HICKCAL_Msk               (0xFFU << ACC_CTRL2_HICKCAL_Pos)        /*!< 0x000000FF */
#define ACC_CTRL2_HICKCAL                   ACC_CTRL2_HICKCAL_Msk                   /*!< Internal high-speed auto clock calibration */
#define ACC_CTRL2_HICKTRIM_Pos              (8U)
#define ACC_CTRL2_HICKTRIM_Msk              (0x3FU << ACC_CTRL2_HICKTRIM_Pos)       /*!< 0x00003F00 */
#define ACC_CTRL2_HICKTRIM                  ACC_CTRL2_HICKTRIM_Msk                  /*!< Internal high-speed auto clock trimming */

/*******************  Bit definition for ACC_CP1 register  ********************/
#define ACC_CP1_C1_Pos                      (0U)
#define ACC_CP1_C1_Msk                      (0xFFFFU << ACC_CP1_C1_Pos)             /*!< 0x0000FFFF */
#define ACC_CP1_C1                          ACC_CP1_C1_Msk                          /*!< Compare 1 */

/*******************  Bit definition for ACC_CP2 register  ********************/
#define ACC_CP2_C2_Pos                      (0U)
#define ACC_CP2_C2_Msk                      (0xFFFFU << ACC_CP2_C2_Pos)             /*!< 0x0000FFFF */
#define ACC_CP2_C2                          ACC_CP2_C2_Msk                          /*!< Compare 2 */

/*******************  Bit definition for ACC_CP3 register  ********************/
#define ACC_CP3_C3_Pos                      (0U)
#define ACC_CP3_C3_Msk                      (0xFFFFU << ACC_CP3_C3_Pos)             /*!< 0x0000FFFF */
#define ACC_CP3_C3                          ACC_CP3_C3_Msk                          /*!< Compare 3 */

/******************************************************************************/
/*                                                                            */
/*                         Quad-SPI interface (QSPI)                          */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for QSPI_CMD_W0 register  ******************/
#define QSPI_CMD_W0_SPIADR_Pos              (0U)
#define QSPI_CMD_W0_SPIADR_Msk              (0xFFFFFFFFU << QSPI_CMD_W0_SPIADR_Pos) /*!< 0xFFFFFFFF */
#define QSPI_CMD_W0_SPIADR                  QSPI_CMD_W0_SPIADR_Msk                  /*!< SPI Flash address */

/*****************  Bit definition for QSPI_CMD_W1 register  ******************/
/*!< ADRLEN congiguration */
#define QSPI_CMD_W1_ADRLEN_Pos              (0U)
#define QSPI_CMD_W1_ADRLEN_Msk              (0x7U << QSPI_CMD_W1_ADRLEN_Pos)        /*!< 0x00000007 */
#define QSPI_CMD_W1_ADRLEN                  QSPI_CMD_W1_ADRLEN_Msk                  /*!< ADRLEN[2:0] bits (SPI address length) */
#define QSPI_CMD_W1_ADRLEN_0                (0x1U << QSPI_CMD_W1_ADRLEN_Pos)        /*!< 0x00000001 */
#define QSPI_CMD_W1_ADRLEN_1                (0x2U << QSPI_CMD_W1_ADRLEN_Pos)        /*!< 0x00000002 */
#define QSPI_CMD_W1_ADRLEN_2                (0x4U << QSPI_CMD_W1_ADRLEN_Pos)        /*!< 0x00000004 */

#define QSPI_CMD_W1_ADRLEN_NOBYTE           0x00000000U                             /*!< No address state */
#define QSPI_CMD_W1_ADRLEN_1BYTE            0x00000001U                             /*!< 1-byte address */
#define QSPI_CMD_W1_ADRLEN_2BYTE            0x00000002U                             /*!< 2-byte address */
#define QSPI_CMD_W1_ADRLEN_3BYTE            0x00000003U                             /*!< 3-byte address */
#define QSPI_CMD_W1_ADRLEN_4BYTE            0x00000004U                             /*!< 4-byte address */

/*!< DUM2 congiguration */
#define QSPI_CMD_W1_DUM2_Pos                (16U)
#define QSPI_CMD_W1_DUM2_Msk                (0xFFU << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00FF0000 */
#define QSPI_CMD_W1_DUM2                    QSPI_CMD_W1_DUM2_Msk                    /*!< DUM2[7:0] bits (Second dummy state cycle) */
#define QSPI_CMD_W1_DUM2_0                  (0x01U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00010000 */
#define QSPI_CMD_W1_DUM2_1                  (0x02U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00020000 */
#define QSPI_CMD_W1_DUM2_2                  (0x04U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00040000 */
#define QSPI_CMD_W1_DUM2_3                  (0x08U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00080000 */
#define QSPI_CMD_W1_DUM2_4                  (0x10U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00100000 */
#define QSPI_CMD_W1_DUM2_5                  (0x20U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00200000 */
#define QSPI_CMD_W1_DUM2_6                  (0x40U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00400000 */
#define QSPI_CMD_W1_DUM2_7                  (0x80U << QSPI_CMD_W1_DUM2_Pos)         /*!< 0x00800000 */

/*!< INSLEN congiguration */
#define QSPI_CMD_W1_INSLEN_Pos              (24U)
#define QSPI_CMD_W1_INSLEN_Msk              (0x3U << QSPI_CMD_W1_INSLEN_Pos)        /*!< 0x03000000 */
#define QSPI_CMD_W1_INSLEN                  QSPI_CMD_W1_INSLEN_Msk                  /*!< INSLEN[1:0] bits (Instruction code length) */
#define QSPI_CMD_W1_INSLEN_0                (0x1U << QSPI_CMD_W1_INSLEN_Pos)        /*!< 0x01000000 */
#define QSPI_CMD_W1_INSLEN_1                (0x2U << QSPI_CMD_W1_INSLEN_Pos)        /*!< 0x02000000 */

#define QSPI_CMD_W1_INSLEN_NOINS            0x00000000U                             /*!< No instruction code */
#define QSPI_CMD_W1_INSLEN_1INS             0x01000000U                             /*!< 1-byte instruction code */
#define QSPI_CMD_W1_INSLEN_2INS             0x02000000U                             /*!< 2-byte instruction code (repeated instruction code) */

#define QSPI_CMD_W1_PEMEN_Pos               (28U)
#define QSPI_CMD_W1_PEMEN_Msk               (0x1U << QSPI_CMD_W1_PEMEN_Pos)         /*!< 0x10000000 */
#define QSPI_CMD_W1_PEMEN                   QSPI_CMD_W1_PEMEN_Msk                   /*!< Performance enhanced mode enable */

/*****************  Bit definition for QSPI_CMD_W2 register  ******************/
#define QSPI_CMD_W2_DCNT_Pos                (0U)
#define QSPI_CMD_W2_DCNT_Msk                (0xFFFFFFFFU << QSPI_CMD_W2_DCNT_Pos)   /*!< 0xFFFFFFFF */
#define QSPI_CMD_W2_DCNT                    QSPI_CMD_W2_DCNT_Msk                    /*!< Read/Write data counter */

/*****************  Bit definition for QSPI_CMD_W3 register  ******************/
#define QSPI_CMD_W3_WEN_Pos                 (1U)
#define QSPI_CMD_W3_WEN_Msk                 (0x1U << QSPI_CMD_W3_WEN_Pos)           /*!< 0x00000002 */
#define QSPI_CMD_W3_WEN                     QSPI_CMD_W3_WEN_Msk                     /*!< Write data enable */
#define QSPI_CMD_W3_RSTSEN_Pos              (2U)
#define QSPI_CMD_W3_RSTSEN_Msk              (0x1U << QSPI_CMD_W3_RSTSEN_Pos)        /*!< 0x00000004 */
#define QSPI_CMD_W3_RSTSEN                  QSPI_CMD_W3_RSTSEN_Msk                  /*!< Read SPI status enable */
#define QSPI_CMD_W3_RSTSC_Pos               (3U)
#define QSPI_CMD_W3_RSTSC_Msk               (0x1U << QSPI_CMD_W3_RSTSC_Pos)         /*!< 0x00000008 */
#define QSPI_CMD_W3_RSTSC                   QSPI_CMD_W3_RSTSC_Msk                   /*!< Read SPI status configuration */

/*!< OPMODE congiguration */
#define QSPI_CMD_W3_OPMODE_Pos              (5U)
#define QSPI_CMD_W3_OPMODE_Msk              (0x7U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x000000E0 */
#define QSPI_CMD_W3_OPMODE                  QSPI_CMD_W3_OPMODE_Msk                  /*!< OPMODE[2:0] bits (SPI Operation mode) */
#define QSPI_CMD_W3_OPMODE_0                (0x1U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x00000020 */
#define QSPI_CMD_W3_OPMODE_1                (0x2U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x00000040 */
#define QSPI_CMD_W3_OPMODE_2                (0x4U << QSPI_CMD_W3_OPMODE_Pos)        /*!< 0x00000080 */

#define QSPI_CMD_W3_OPMODE_SERIAL           0x00000000U                             /*!< Serial mode (1-1-1) */
#define QSPI_CMD_W3_OPMODE_DUAL             0x00000020U                             /*!< Dual-wire mode (1-1-2) */
#define QSPI_CMD_W3_OPMODE_QUAD             0x00000040U                             /*!< Quad mode (1-1-4) */
#define QSPI_CMD_W3_OPMODE_DUALIO           0x00000060U                             /*!< Dual-wire I/O mode (1-2-2) */
#define QSPI_CMD_W3_OPMODE_QUADIO           0x00000080U                             /*!< Quad I/O mode (1-4-4) */
#define QSPI_CMD_W3_OPMODE_DPI              0x000000A0U                             /*!< DPI mode (2-2-2) */
#define QSPI_CMD_W3_OPMODE_QPI              0x000000C0U                             /*!< QPI mode (4-4-4) */

#define QSPI_CMD_W3_PEMOPC_Pos              (16U)
#define QSPI_CMD_W3_PEMOPC_Msk              (0xFFU << QSPI_CMD_W3_PEMOPC_Pos)       /*!< 0x00FF0000 */
#define QSPI_CMD_W3_PEMOPC                  QSPI_CMD_W3_PEMOPC_Msk                  /*!< Performance enhanced mode operation code */
#define QSPI_CMD_W3_INSC_Pos                (24U)
#define QSPI_CMD_W3_INSC_Msk                (0xFFU << QSPI_CMD_W3_INSC_Pos)         /*!< 0xFF000000 */
#define QSPI_CMD_W3_INSC                    QSPI_CMD_W3_INSC_Msk                    /*!< Instruction code */

/******************  Bit definition for QSPI_CTRL register  *******************/
/*!< CLKDIV congiguration */
#define QSPI_CTRL_CLKDIV_Pos                (0U)
#define QSPI_CTRL_CLKDIV_Msk                (0x7U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000007 */
#define QSPI_CTRL_CLKDIV                    QSPI_CTRL_CLKDIV_Msk                    /*!< CLKDIV[2:0] bits (Clock divider) */
#define QSPI_CTRL_CLKDIV_0                  (0x1U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000001 */
#define QSPI_CTRL_CLKDIV_1                  (0x2U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000002 */
#define QSPI_CTRL_CLKDIV_2                  (0x4U << QSPI_CTRL_CLKDIV_Pos)          /*!< 0x00000004 */

#define QSPI_CTRL_CLKDIV_DIV2               0x00000000U                             /*!< Clock is divided by 2 */
#define QSPI_CTRL_CLKDIV_DIV4               0x00000001U                             /*!< Clock is divided by 4 */
#define QSPI_CTRL_CLKDIV_DIV6               0x00000002U                             /*!< Clock is divided by 6 */
#define QSPI_CTRL_CLKDIV_DIV8               0x00000003U                             /*!< Clock is divided by 8 */
#define QSPI_CTRL_CLKDIV_DIV3               0x00000004U                             /*!< Clock is divided by 3 */
#define QSPI_CTRL_CLKDIV_DIV5               0x00000005U                             /*!< Clock is divided by 5 */
#define QSPI_CTRL_CLKDIV_DIV10              0x00000006U                             /*!< Clock is divided by 10 */
#define QSPI_CTRL_CLKDIV_DIV12              0x00000007U                             /*!< Clock is divided by 12 */

#define QSPI_CTRL_SCKMODE_Pos               (4U)
#define QSPI_CTRL_SCKMODE_Msk               (0x1U << QSPI_CTRL_SCKMODE_Pos)         /*!< 0x00000010 */
#define QSPI_CTRL_SCKMODE                   QSPI_CTRL_SCKMODE_Msk                   /*!< SCK output mode */
#define QSPI_CTRL_XIPIDLE_Pos               (7U)
#define QSPI_CTRL_XIPIDLE_Msk               (0x1U << QSPI_CTRL_XIPIDLE_Pos)         /*!< 0x00000080 */
#define QSPI_CTRL_XIPIDLE                   QSPI_CTRL_XIPIDLE_Msk                   /*!< XIP port idle status */
#define QSPI_CTRL_ABORT_Pos                 (8U)
#define QSPI_CTRL_ABORT_Msk                 (0x1U << QSPI_CTRL_ABORT_Pos)           /*!< 0x00000100 */
#define QSPI_CTRL_ABORT                     QSPI_CTRL_ABORT_Msk                     /*!< Refresh all commands/FIFOs and reset state machine */

/*!< BUSY congiguration */
#define QSPI_CTRL_BUSY_Pos                  (16U)
#define QSPI_CTRL_BUSY_Msk                  (0x7U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00070000 */
#define QSPI_CTRL_BUSY                      QSPI_CTRL_BUSY_Msk                      /*!< BUSY[2:0] bits (Busy bit of SPI status) */
#define QSPI_CTRL_BUSY_0                    (0x1U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00010000 */
#define QSPI_CTRL_BUSY_1                    (0x2U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00020000 */
#define QSPI_CTRL_BUSY_2                    (0x4U << QSPI_CTRL_BUSY_Pos)            /*!< 0x00040000 */

#define QSPI_CTRL_BUSY_BIT0                 0x00000000U                             /*!< Bit 0 */
#define QSPI_CTRL_BUSY_BIT1                 0x00010000U                             /*!< Bit 1 */
#define QSPI_CTRL_BUSY_BIT2                 0x00020000U                             /*!< Bit 2 */
#define QSPI_CTRL_BUSY_BIT3                 0x00030000U                             /*!< Bit 3 */
#define QSPI_CTRL_BUSY_BIT4                 0x00040000U                             /*!< Bit 4 */
#define QSPI_CTRL_BUSY_BIT5                 0x00050000U                             /*!< Bit 5 */
#define QSPI_CTRL_BUSY_BIT6                 0x00060000U                             /*!< Bit 6 */
#define QSPI_CTRL_BUSY_BIT7                 0x00070000U                             /*!< Bit 7 */

#define QSPI_CTRL_XIPRCMDF_Pos              (19U)
#define QSPI_CTRL_XIPRCMDF_Msk              (0x1U << QSPI_CTRL_XIPRCMDF_Pos)        /*!< 0x00080000 */
#define QSPI_CTRL_XIPRCMDF                  QSPI_CTRL_XIPRCMDF_Msk                  /*!< XIP read command flush */
#define QSPI_CTRL_XIPSEL_Pos                (20U)
#define QSPI_CTRL_XIPSEL_Msk                (0x1U << QSPI_CTRL_XIPSEL_Pos)          /*!< 0x00100000 */
#define QSPI_CTRL_XIPSEL                    QSPI_CTRL_XIPSEL_Msk                    /*!< XIP port selection */
#define QSPI_CTRL_KEYEN_Pos                 (21U)
#define QSPI_CTRL_KEYEN_Msk                 (0x1U << QSPI_CTRL_KEYEN_Pos)           /*!< 0x00200000 */
#define QSPI_CTRL_KEYEN                     QSPI_CTRL_KEYEN_Msk                     /*!< SPI data encryption key enable */

